In [21]:
#1.Import package
#2.Create data frame
#3.Perform preprocessing task
#4.Split data frame into input and output features
#5.Create train and test data set
#6.Fitting a ML model
#7.Performance analysis

NAIVE BAYES

In [22]:
import pandas as pd
df = pd.read_csv("D:/Engineering/Sem6/ml/lab/titanic.csv")
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df.drop(['Name','PassengerId','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns', inplace=True)

In [24]:
inputs = df.drop('Survived', axis='columns')
target = df.Survived

In [25]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [26]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [27]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [28]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [29]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [30]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [31]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [32]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [33]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [34]:
model.fit(X_train,y_train)

GaussianNB()

In [35]:
model.score(X_test,y_test)

0.7910447761194029

In [36]:
X_test[0:10]

     Pclass        Age      Fare  female
731       3  11.000000   18.7875       0
843       3  34.500000    6.4375       0
829       1  62.000000   80.0000       1
230       1  35.000000   83.4750       1
8         3  27.000000   11.1333       1
581       1  39.000000  110.8833       1
739       3  29.699118    7.8958       0
262       1  52.000000   79.6500       0
301       3  29.699118   23.2500       0
545       1  64.000000   26.0000       0

In [39]:
y_test

731    0
843    0
829    1
230    1
8      1
      ..
816    0
415    0
72     0
170    0
247    1
Name: Survived, Length: 268, dtype: int64

In [40]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 0, 1, 0, 1, 0, 0], dtype=int64)

In [41]:
model.predict_proba(X_test[:10])

array([[0.95695603, 0.04304397],
       [0.96916516, 0.03083484],
       [0.0103085 , 0.9896915 ],
       [0.01143075, 0.98856925],
       [0.5025951 , 0.4974049 ],
       [0.00107869, 0.99892131],
       [0.96872453, 0.03127547],
       [0.2896378 , 0.7103622 ],
       [0.96887823, 0.03112177],
       [0.71658567, 0.28341433]])

In [42]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.776     , 0.664     , 0.768     , 0.74193548, 0.83064516])